In [1]:
import pandas as pd

In [4]:
df = pd.read_csv("D:\Projects\Titanic NB\Titanic Data.xlsx.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [5]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [16]:
X = df.drop('Survived',axis='columns')
y = df.Survived

In [17]:
dummies = pd.get_dummies(X.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [18]:
X = pd.concat([X,dummies],axis='columns')
X.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [19]:
X.drop(['Sex'], axis=1, inplace=True)
X

     Pclass   Age     Fare  female  male
0         3  22.0   7.2500       0     1
1         1  38.0  71.2833       1     0
2         3  26.0   7.9250       1     0
3         1  35.0  53.1000       1     0
4         3  35.0   8.0500       0     1
..      ...   ...      ...     ...   ...
886       2  27.0  13.0000       0     1
887       1  19.0  30.0000       1     0
888       3   NaN  23.4500       1     0
889       1  26.0  30.0000       0     1
890       3  32.0   7.7500       0     1

[891 rows x 5 columns]

In [21]:
X.columns[X.isna().any()].value_counts()

Age    1
dtype: int64

In [22]:
X.Age.isna().value_counts()

False    714
True     177
Name: Age, dtype: int64

In [47]:

X.Age = X.Age.fillna(X.Age.mean())
X.head(5)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [48]:
Age_Count = df.groupby('Age')['Age'].agg('count').sort_values(ascending=False)
Age_Count.head(10)

Age
24.0    30
22.0    27
18.0    26
30.0    25
28.0    25
19.0    25
21.0    24
25.0    23
36.0    22
29.0    20
Name: Age, dtype: int64

In [61]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.3)

In [62]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [63]:
model.fit(X_train,y_train)

GaussianNB()

In [64]:
model.score(X_test,y_test)

0.8134328358208955

In [65]:
X_test[0:10]

     Pclass   Age     Fare  female  male
127       3  24.0   7.1417       0     1
103       3  33.0   8.6542       0     1
503       3  37.0   9.5875       1     0
391       3  21.0   7.7958       0     1
632       1  32.0  30.5000       0     1
772       2  57.0  10.5000       1     0
165       3   9.0  20.5250       0     1
780       3  13.0   7.2292       1     0
882       3  22.0  10.5167       1     0
208       3  16.0   7.7500       1     0

In [70]:
y_test[0:10]

127    1
103    0
503    0
391    1
632    1
772    0
165    1
780    1
882    0
208    1
Name: Survived, dtype: int64

In [69]:
model.predict(X_test[0:10])

array([0, 0, 1, 0, 0, 1, 0, 1, 1, 1], dtype=int64)

In [68]:
model.predict_proba(X_test[:10])

array([[0.98807142, 0.01192858],
       [0.98916876, 0.01083124],
       [0.11309852, 0.88690148],
       [0.9874694 , 0.0125306 ],
       [0.89584103, 0.10415897],
       [0.03977117, 0.96022883],
       [0.98274511, 0.01725489],
       [0.08213418, 0.91786582],
       [0.10034332, 0.89965668],
       [0.08861464, 0.91138536]])

### Calculate the score using cross validation

In [76]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=200).mean()

0.77